# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# N = 6 | N = 12 | 32 | 13 | 9 | 18 | 21
# 2 * 3 | 2 * 2 * 3 | 2 * 2 * 2 * 2 * 2 | 13 | 3 * 3 | 2 * 3 * 3 | 3*7

N = int(input('N = '))

divide = []

for i in range(2, N + 1):
    while N % i == 0:
        divide.append(i)
        N //= i

print(*divide, sep=' * ')